/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   print_map.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ashari <ashari@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/04/27 15:38:56 by ashari            #+#    #+#             */
/*   Updated: 2019/04/27 23:16:38 by ashari           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fdf.h"

/*
*	Возможны проблемы с определением y1 y2 (неккоректно учит координаты)
*	Эта функция вызывается после определения новых коорд (0;0)
*/

void			print_map(t_window *w)
{
	int		i;

	i = -1;
	w->x1 = w->start_x;
	w->x2 = w->start_x;
	w->y1 = w->start_y;
	w->y2 = w->start_y;
	while (w->p[++i])
	{
		w->x1 = (w->p[i]->x + w->p[i]->y) * cos(0.523599);
		w->y1 = (w->p[i]->x - w->p[i]->y) * cos(0.523599) - w->p[i]->z;
		w->x2 = (w->p[i + 1]->x + w->p[i + 1]->y) * cos(0.523599);
		w->y2 = (w->p[i + 1]->x - w->p[i + 1]->y) * cos(0.523599) - w->p[i]->z;
		ft_brezen(w);
	}
}


